In [127]:
import pandas as pd
import numpy as np

In [128]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['States'] = "CA NV AZ".split()
df.set_index('States',inplace=True)

In [129]:
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

## Dropping row or columns based on the nan values

In [130]:
df.dropna(axis=0)
## here i am giving axis = 0 hence it will drop the rows that have nan values

          A    B  C
States
CA      1.0  5.0  1

In [131]:
df.dropna(axis=1)
# ## here i am giving axis = 1 hence it will drop the columns that have nan values

        C
States
CA      1
NV      2
AZ      3

In [132]:
df.dropna(thresh=2)
## Here what happens when thresh is 2 then what happens is if the row contains less that 2 NON-NAN values then it 
## will be dropped

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [133]:
df.dropna(thresh=2)
## here as you can see the rows are not getting dropped since the thresh is 1 and there is atleast one NON_NAN values
## in the dataframe

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [134]:
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

## we have null values in the dataframe and now we should fill them using fillna

In [135]:
df.fillna(value="Fill value")
## here in place of value you can give whatever you want the NAN values to be filled with.

                 A           B  C
States
CA             1.0         5.0  1
NV             2.0  Fill value  2
AZ      Fill value  Fill value  3

## we will fill the null values by mean of column A

In [136]:
df.fillna(value=df['A'].mean())
## you can see below that the null values are being filled or replaced with the average of column A

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  1.5  2
AZ      1.5  1.5  3

In [137]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df1 = pd.DataFrame(data)
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

## groupby

In [138]:
df1.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [139]:
df1.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [140]:
df1.groupby('Company')['Sales'].mean()
## here the using the groupby i found the mean of the sales from each company

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [141]:
df1.groupby('Company')['Sales'].sum()
## this is returning the summation of sales based on the companies

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

## performing describe operation on groupby

In [142]:
df1.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### IN the below code i am using describe()['sales'] because it has index of the index hence used that

In [143]:
df1.groupby('Company').describe()['Sales'].loc[["GOOG","MSFT"],["std","min"]]

                std    min
Company
GOOG      56.568542  120.0
MSFT     152.735065  124.0

## to rotated the data using the transpose() method

In [144]:
d = df1.groupby('Company').describe()
d.transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [145]:
df1.groupby('Company').describe().loc['GOOG']['Sales']['std']

56.568542494923804

In [146]:
# Merging two data frames
# Creating data frames
df2 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [147]:
df2

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [148]:
df3 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[0,1,2,3])

In [149]:
df3

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [150]:
df4 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8,9,10,11])

In [151]:
df4

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## concatenation operation

In [152]:
df_cat1 = pd.concat([df2,df3,df4],axis=1)

In [153]:
df_cat1

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0   A4   B4   C4   D4  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1   A5   B5   C5   D5  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2   A6   B6   C6   D6  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [154]:
df_cat1.fillna(value=0,inplace=True)
df_cat1

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0  A4  B4  C4  D4    0    0    0    0
1   A1  B1  C1  D1  A5  B5  C5  D5    0    0    0    0
2   A2  B2  C2  D2  A6  B6  C6  D6    0    0    0    0
3   A3  B3  C3  D3  A7  B7  C7  D7    0    0    0    0
8    0   0   0   0   0   0   0   0   A8   B8   C8   D8
9    0   0   0   0   0   0   0   0   A9   B9   C9   D9
10   0   0   0   0   0   0   0   0  A10  B10  C10  D10
11   0   0   0   0   0   0   0   0  A11  B11  C11  D11

## merging by a common key

In [155]:
left = pd.DataFrame({'key': ['K0', 'K8', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [156]:
left

  key   A   B
0  K0  A0  B0
1  K8  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [157]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [158]:
merge1 = pd.merge(left,right,how='inner',on='key')
merge1

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

## these are the 2 dataframe's and there is no common key in between the 2 dataframes so how to to merge

In [159]:
df1_mer = pd.DataFrame({'key1': ['K0', 'K8', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
df2_mer = pd.DataFrame({'key2': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [161]:
df1_mer

  key1   A   B
0   K0  A0  B0
1   K8  A1  B1
2   K2  A2  B2
3   K3  A3  B3

In [162]:
df2_mer

  key2   C   D
0   K0  C0  D0
1   K1  C1  D1
2   K2  C2  D2
3   K3  C3  D3

In [164]:
df_mer = pd.merge(df1_mer,df2_mer,how='inner',left_on='key1',right_on='key2')

In [165]:
df_mer

  key1   A   B key2   C   D
0   K0  A0  B0   K0  C0  D0
1   K2  A2  B2   K2  C2  D2
2   K3  A3  B3   K3  C3  D3

## right join

In [166]:
df_mer_right = pd.merge(df1_mer,df2_mer,how='right',left_on='key1',right_on='key2')

In [167]:
df_mer_right

  key1    A    B key2   C   D
0   K0   A0   B0   K0  C0  D0
1  NaN  NaN  NaN   K1  C1  D1
2   K2   A2   B2   K2  C2  D2
3   K3   A3   B3   K3  C3  D3

## left join

In [ ]:
df_mer_left = pd.merge(df1_mer,df2_mer,how='right',left_on='key1',right_on='key2')